{
  "joys": [
    {
      "id": 0,
      "name": "Fenella Powell",
      "date": "11/07/2023",
      "youtube": {
        "id": "rmdiaQM43bk",
        "title": "Walking on Sunshine",
        "artist": "Katrina & The Waves"
      },
      "quote": {
        "message": "You are braver than you believe, stronger than you seem, and smarter than you think.",
        "name": "A.A. Milne"
      },
      "message": "Good Morning @channel\nI thought I would pop in and start the ✨ Daily Joy Challenge ✨\nEvery morning one member of the cohort posts some motivational / inspirational / words of their own or a quote, along with a song of their choice to bring some joy to the cohort for the day\nMy choice of song as a classic wake up song Walking on Sunshine\nMy go to quote is also this one\n“You are braver than you believe, stronger than you seem, and smarter than you think.” - A.A. Milne\nI tag @Benedict to bring in the joy tomorrow! Have a great day!"
    },
    {
      "id": 1,
      "name": "Benedict Valuks",
      "date": "12/07/2023",
      "youtube": {
        "id": "aQUlA8Hcv4s",
        "title": "Mr Blue Sky",
        "artist": "The Electric Light Orchestra"
      },
      "quote": {
        "message": "I have not failed. I've just found 10,000 ways that won't work.",
        "name": "Thomas A. Edison"
      },
      "message": "Good morning everyone!\nI'm feeling energised after my cycle ride in.\nIt is my turn this morning to bring the joy in the ✨ Daily Joy Challenge ✨\nFirstly, I'd like to thank everyone for their support so far. I am very excited about the journey ahead.My choice of song is Mr Blue Sky by The Electric Light Orchestra. It is one of my absolute favourite songs and is nothing but positive vibes.\nFor my quote, I have chosen one which I think is is quite applicable to coding:“I have not failed. I've just found 10,000 ways that won't work.”\n― Thomas A. EdisonI hope everyone has a great day!"
    },
    {
      "id": 2,
      "name": "Rikie Patrick",
      "date": "13/07/2023",
      "youtube": {
        "id": "phXRX1p8woY",
        "title": "We Are All We Need",
        "artist": "Above and Beyond"
      },
      "quote": {
        "message": "There is still a lot to learn and there is always great stuff out there. Even mistakes can be wonderful",
        "name": "Robin Williams"
      },
      "message": "Thanks @Benedict for the nomination in the ✨ Daily Joy Challenge ✨\nI would also like to echo Ben's words from yesterday. Don't ever be afraid to reach out for help and support if you need it. Looking forward to the next 4 months and beyond.\nMy choice of song comes from a trio I have seen many times. Their sets always fill the room with such happiness and euphoria! Zoë Johnston features with stunning vocals on a song by Above and Beyond called “We’re All We Need”.\nMy inspirational quote comes from an incredible actor; the late, great and talented Robin Williams who dedicated his life to putting smile on other peoples face.\n“There is still a lot to learn and there is always great stuff out there. Even mistakes can be wonderful”\n ― Robin Williams\n@Ellie Priestley 🫵 You're up next!\nHave an awesome day! 👋"
    },
    {
      "id": 3,
      "name": "Ellie Priestley",
      "date": "14/07/2023",
      "youtube": {
        "id": "Gs069dndIYk",
        "title": "September",
        "artist": "Earth, Wind & Fire"
      },
      "quote": {
        "message": "The rest is just as important as the work"
      },
      "message": "Thanks for the nomination @Rikie Patrick, and happy Friday everyone!\nSo crazy to think we're almost at the end of our first week! Hope everyone is feeling positive and ready for an amazing weekend! ☺️With that theme in mind, my quote for ✨Daily Joy Challenge✨ today is:\n\"The rest is just as important as the work\"\nI've had to remind myself of this constantly this week - it's so easy to get hooked on the challenges and before you know it hours have passed! Remember we're only a week into our four months, and that it's a marathon rather than a sprint. Let's make sure to all take some time this weekend to recharge and reset so we can all be energised for next week 🥳Following on from the Friday theme, my song of the day pick is \"September\" by Earth, Wind & Fire: an absolute classic Friday bop 🕺\nMy nomination for Monday is @Kumani! Have a restful weekend all and see you soon 💫"
    },
    {
      "id": 4,
      "name": "Kumani Kidd",
      "date": "17/07/2023",
      "youtube": {
        "id": "NqMsXDd1_no",
        "title": "I can see clearly now",
        "artist": "Jimmy Cliff"
      },
      "quote": {
        "message": "The future belongs to those who believe in the beauty of their dreams",
        "name": "Eleanor Roosevelt"
      },
      "message": "Good moring! Thank you for the nomination @Ellie Priestley, I hope we all had a lovely weekend and got the rest needed for our second week.\nThis time last week I was worried about starting the course, overthinking it all, but after meeting the cohort / staff and getting started those nerves are all gone.\nSo the feel good vibes of Jimmy cliff - I can see clearly now , seems fitting for todays song\nOnce I heard this quote it stuck with me:\n\"The future belongs to those who believe in the beauty of their dreams.\"\n- Eleanor Roosevelt\nFor tuesdays challenge I nominate @Senthooran\nBig up everyone, I hope you have a good day 🙌"
    },
    {
      "id": 5,
      "name": "Senthooran",
      "date": "18/07/2023",
      "youtube": {
        "id": "W0DM5lcj6mw",
        "title": "Believer",
        "artist": "Imagine Dragons"
      },
      "quote": {
        "message": "No regrets just lessons. No worries just acceptance. No expectations just gratitude. Life is too short."
      },
      "message": "Good morning everyone!!! Thank you for the nomination, @Kumani.Hope everyone started the week with full energy and hope. This is a very challenging moment for me in my life. Change of career from entirely different fields. Had a very tough time to get myself adapted into this. But now I got a feeling that I'm learning new things and keep me very excited and interesting. Whatever life gives you, even if it hurts you, just be strong and act like you're okay. Strong walls shake but never collapse. Hopefully, this song makes you believe more in yourself. My go-to quote is also this one:No regrets just lessons. No worries just acceptance. No expectations just gratitude. Life is too short. I nominate  @Emily Cowan to bring in the joy tomorrow! Have a great day!"
    },
    {
      "id": 6,
      "name": "Emily Cowan",
      "date": "19/07/2023",
      "youtube": {
        "id": "PWgvGjAhvIwMy",
        "title": "Hey Ya!",
        "artist": "Outkast"
      },
      "quote": {
        "message": "Have courage and be kind.",
        "name": "Cinderella"
      },
      "message": "Good afternoon! I forgot to post my :raised_hands: Daily Joy Challenge :raised_hands: this morning to here we go as an afternoon pick-me-up instead. Thanks @Senthooran for the nomination!I hope we're all feeling okay! It's been so, so lovely getting to know you all over the past week and a half and I'm looking forward to good things to come as we continue to learn. Wednesdays tend to be a tough day to get through for some, so I've chosen my song as a sure fire energy-booster (honestly, try not to dance to it). So, my chosen song is Hay-Ya by Outkast, give it a listen. Quote is from Cinderella, I ALWAYS think of it when I need a quick bit of inspo and it's \"Have courage and be kind.\" I really think that is a perfect way to live your life.I nominate @Mohsina Ahmed Chowdhury for tomorrow's joy challenge! Thanks everyone 💖"
    },
    {
      "id": 7,
      "name": "Mohsina Ahmed Chowdhury",
      "date": "20/07/2023",
      "youtube": {
        "id": "egkrxkiUnoo",
        "title": "Best Movie Quote",
        "artist": "Forest Gump"
      },
      "quote": {
        "message": "Life is like a box of chocolates, you never know what you're gonna get!",
        "name": "Forest Gump"
      },
      "message": "Good morning, everyone! I couldn't resist sharing my message bright and early for our 🙌 Daily Joy Challenge 🙌 . A big thank you to @Emily Cowan for the nomination! I hope each of you is having a wonderful time and feeling great! As the weeks pass, the course seems to get more intense, but let's remember that every day is an opportunity to learn something new and exciting. Some days, we'll breeze through our challenges, while others might have us scratching our heads in search of that elusive solution. But fear not, for these challenges make us grow and become better! To inspire you all, I've chosen one of my favourite lines from the beloved movie Forest Gump: \"Life is like a box of chocolates, you never know what you're gonna get!\" Now, I'm delighted to nominate the fabulous @Denise Chan for next joy challenge! Spread the joy and keep coding happily 🤪!"
    },
    {
      "id": 8,
      "name": "Denise Chan",
      "date": "21/07/2023",
      "youtube": {
        "id": "1SkoD2CIakQ",
        "title": "Tain't What You Do",
        "artist": "Jimmy Lunceford"
      },
      "quote": {
        "message": "Give yourself permission to be kind to yourself"
      },
      "message": "Thanks for the nomination @Mohsina Ahmed Chowdhury and happy Friday everyone 🥂 Can't believe it's now the last day of the second week and we have all come so far along with the python drills and challenges! I hope everyone is feeling excited that it's almost the weekend and ready to get some well deserved rest 😇 For my song, I would like to share one that I was dancing to on a regular when I was swing dancing in Hong Kong and for those that don't know swing dancing, this one is a banger that everyone in the community joins in before the night ends (aka the Shim Sham)💃 (be patient for the first minute and enjoy the jazz tunes, lyrics starts at 1:00 😉)As for my quote, I would like to share something that resonated with me a lot recently and something that I am trying to manifest. \"Give yourself permission to be kind to yourself\" This week as I was working on chapter 3's challenge, I wasn't being kind to myself and started dreaming about the solutions 😴 It wasn't healthy and I wished I had put my worries aside! @Hafsah reminded me to make a plan the day before so I can go to bed worry free!Bonus content: enjoy a short video of table tennis x classical music collab by a few from our cohort!My nomination for Monday is @Ami Have an amazing weekend all and see you all on Monday 🙂"
    },
    {
      "id": 9,
      "name": "Ami Day",
      "date": "24/07/2023",
      "youtube": {
        "id": "b1kbLwvqugk",
        "title": "Anti-Hero",
        "artist": "Taylor Swift"
      },
      "quote": {
        "message": "Do not judge me by my successes, judge me by how many times i fell down and got back up again",
        "name": "Nelson Mandela"
      },
      "message": "Hi everyone, I hope you had a great weekend and thanks for the nomination @Denise Chan! My chosen quote is: \"Do not judge me by my successes, judge me by how many times i fell down and got back up again\" (Nelson Mandela) and chosen song is \"anti-hero\" by Taylor Swift. Have a lovely week! I am looking forward to learning about pair programming 🙂 I nominate @Roberto Quadraccia"
    },
    {
      "id": 10,
      "name": "Roberto Quadraccia",
      "date": "25/07/2023",
      "youtube": {
        "id": "Gs069dndIYk",
        "title": "September",
        "artist": "Earth, Wind & Fire"
      },
      "quote": {
        "message": "I have not failed. I've just found 10,000 ways that won't work.",
        "name": "Thomas Edison"
      },
      "message": "Thanks @Ami for the nomination and happy Tuesday everyone 🥂.I would like to express my satisfaction for what i achieved during the first two weeks of our amazing learning journey together.I guess some of us, including me, experienced a roller coaster of feelings. Some days very confident, some days stuck for hours into challenges. Therefore, I thought this quote from Thomas Edison it's something we may relate to right now, in terms of coding: “I have not failed. I've just found 10,000 ways that won't work.” 😁 As we progress, we have now entered a more advanced phase and the latter includes pair programming. To be honest, although I love coding on my own, I really enjoyed yesterday's session with @Kumani and in addition to that, the idea of moving forward as a WHOLE in order to leave nobody behind. 💪Finally, I found this song particularly suitable to begin our day with the right mood (or at least is the kind of effect it has on me ) Have a cheerful day all!! Ah!! I nearly forgot!! I nominate @Alina Ermakova. 😊"
    },
    {
      "id": 11,
      "name": "Alina Ermakova",
      "date": "02/08/2023",
      "youtube": {
        "id": "NwOvu-j_WjY",
        "title": " Matsuri",
        "artist": "Fujii Kaze"
      },
      "quote": {
        "message": "Happiness is not something ready-made. It comes from your own actions",
        "name": "Dalai Lama"
      },
      "message": "Thanks @Fenella Powell for nomination 😅 To start us off on the right foot, here’s a nugget of wisdom to ponder:“Happiness is not something ready-made. It comes from your own actions.” - Dalai Lama. And to keep the good vibes flowing, here’s a song that never fails to uplift the spirits. Now, let’s keep the joy rolling, @Andrew Shakespeare! Share your quote and song to spread the happiness even further 🙌"
    },
    {
      "id": 12,
      "name": "Andrew Shakespeare",
      "date": "03/08/2023",
      "youtube": {
        "id": "mtQyBOXL6OU",
        "title": "You Are The Reason",
        "artist": "Calum Scott, Barbara Pravi (Cover by Daddy & Abby)"
      },
      "quote": {
        "message": "Life is like riding a bicycle. To keep your balance, you must keep moving",
        "name": "Albert Einstein"
      },
      "message": "Thanks for the nomination @Alina Ermakova! To start us off for the day, I would like to share a brilliant quote that we should all try to follow regardless of whatever situation we may find ourselves in:\"Life is like riding a bicycle. To keep your balance, you must keep moving.\" - Albert Einstein.\nAnd here is a song that I feel very much brightens the mood all around. It's a cover of a Calum Scott song - You Are The Reason - in English and French. Let's keep the joy moving! For tomorrow I nominate @Alexander Wilson!"
    },
    {
      "id": 13,
      "name": "Alexander Wilson",
      "date": "04/08/2023",
      "youtube": {
        "id": "vR-UqOPqGzI",
        "title": "Aruarian Dance",
        "artist": "Nujabes"
      },
      "quote": {
        "message": "To love the journey is to accept no such end. I have found, through painful experience, that the most important step a person can take is always the next one",
        "name": "Dalinar Kholin - Oathbringer (By Brandon Sanderson)"
      },
      "message": "Good morning guys! I hope everyone has had a great week and I'm sure we're all looking forward to the weekend after all the hard work so far 💪 (Can't believe its already been 4 weeks, time flies 🤯) Thank you @Andrew Shakespeare for the nomination! I'd like to start today off with a quote that resonated with me: \"To love the journey is to accept no such end. I have found, through painful experience, that the most important step a person can take is always the next one\" - Dalinar Kholin - Oathbringer (By Brandon Sanderson) We've all embarked on this journey to make a big change in our lives and it's understandably very daunting, with a lot of hard work involved. I've definitely felt anxious about what lies ahead. But despite all our worries, as long as we take things one day at a time and in our own pace, we'll make it ⭐ For today's song, I wanted to share a favourite chill track of mine. It's called Aruarian Dance by Nujabes. For Monday's challenge, I nominate @Carolina Happy Friday everyone and hope you all have lovely and restful weekends 🥂"
    },
    {
      "id": 14,
      "name": "Carolina",
      "date": "07/08/2023",
      "youtube": {
        "id": "09_s_Kh8sls",
        "title": "Tá Escrito (Ao Vivo no Morro)",
        "artist": "Grupo Revelação"
      },
      "quote": {
        "message": "Boldness has genius, power, and magic in it",
        "name": "Goethe"
      },
      "message": "Happy Monday everyone!Thanks @Alexander Wilson for the nomination! Also, thank you all for sharing your fave tracks everyday. It's become part of my morning routine listening to playlists based on the songs you share, and I must say that you really know how to cheer up. 🐱The song I chose for today is from a Brazilian group and talks about having hope and being confident that you'll achieve your goals as long as you do your bit and brave the hard times. Although the lyrics aren't in English, the beauty of music is that you don't necessarily need the lyrics to get its vibes. ☺️My quote for today's ✨Daily Joy Challenge✨ is: “Boldness has genius, power, and magic in it” - Goethe. As time goes, we might forget it, but the very decision of starting this course makes us all pretty bold 😎. So ✨stay bold, stay magical✨.I tag @Huda for tomorrow. Have a great week! 🌻"
    },
    {
      "id": 15,
      "name": "Huda",
      "date": "08/08/2023",
      "youtube": {
        "id": "bmerGZ3_m8E",
        "title": "Unstoppable",
        "artist": "Sia"
      },
      "quote": {
        "message": "The more you feed your mind with positive thoughts, the more you attract great things into your life"
      },
      "message": "Good morning everyone! Thank you for the nomination @Carolina. The song I chose for today's  ✨Daily Joy Challenge✨ is: Unstoppable by Sia. If you need a song to get you through the rest of the work week... then this is the song you've been waiting for. My quote for today’s ✨Daily Joy Challenge✨ is: “The more you feed your mind with positive thoughts, the more you attract great things into your life” - anon. Hope you all have a great day! I nominate @Zubayda Hagi for tomorrow’s daily joy challenge"
    },
    {
      "id": 16,
      "name": "Zubayda Hagi",
      "date": "09/08/2023",
      "youtube": {
        "id": "1k8craCGpgs",
        "title": "Don't Stop Believin'",
        "artist": "Journey"
      },
      "quote": {
        "message": "If we all did the things we are capable of, we would literally astound ourselves",
        "name": "Thomas Edison"
      },
      "message": "Good morning, radiant souls! 😎😎😎😎 Thank you @Huda for the nomination to be the bringer of joy on this fine day! I hope the sunbeams have woven their magic, filling your hearts with boundless joy – they certainly have for me! ✨✨✨✨✨ As I look back on the past few weeks, a journey that's been both demanding and dynamic, with its share of ups and downs, I'm reminded of the incredible power of simply showing up. Each of you has contributed to this journey, and I extend my heartfelt gratitude for being on this exhilarating ride with me.And on that vein I will be sharing a song that is very much a story of journeys… my song today is…drumroll…Don’t stop believing!https://m.youtube.com/watch?v=1k8craCGpgsBefore we part ways for the day, allow me to share the wisdom of Mr. Thomas Edison 💡💡💡: \"If we all did the things we are capable of, we would literally astound ourselves.\" If this doesn’t inspire you to roll up your sleeves and jump into the abyss then hopefully it will at least motivate you to take just 1 more step forward towards your dreams!I wish you all a productive day full of sunshine and joy 🤩 🤩🤩 Now, it's time to pass the torch of joy to the wonderful @Sarah to bring us the joy tomorrow morning ✨✨✨✨"
    },
    {
      "id": 17,
      "name": "Sarah Ellis",
      "date": "10/08/2023",
      "youtube": {
        "id": "6sIjSNTS7Fs",
        "title": "Sir Duke",
        "artist": "Stevie Wonder"
      },
      "quote": {
        "message": "We rise by lifting others",
        "name": "Robert Ingersoll"
      },
      "message": "Hello everyone, this is your ✨ daily dose of joyfulness!✨ Thank you @Zubayda Hagi for the nomination and for the beautiful sentiments you started us off with yesterday 🌺☀️.I've chosen a quote which inspires me, by Robert Ingersoll: \"We rise by lifting others\". Along with it, I'd like to express my deep gratitude to everyone who has already lifted my spirits and/or knowledge of programming during the short time we've spent together on the course. I'm very much enjoying sharing the journey with you all, and learning from and with you!The joy boost track I'm sharing is ✨Stevie Wonder's Sir Duke✨: May you, and your terminals, be happy and healthy 🙌. ✨I tag @Jake Siney for tomorrow!"
    },
    {
      "id": 18,
      "name": "Jake Siney",
      "date": "11/08/2023",
      "youtube": {
        "id": "ovo6zwv6DX4",
        "title": "Dancing On The Ceiling",
        "artist": "Lionel Richie"
      },
      "quote": {
        "message": "Success is not final, failure is not fatal: It is the courage to continue that counts",
        "name": "Winston Churchill"
      },
      "message": "Hi Team, welcome to the ✨Weekend edition of joy! ✨Thanks @Sarah Ellis for the nomination. With our last week together as a group approaching I wanted to say it's been a pleasure spending this time with you all. No matter which path you've selected, I have no doubt that each of you will find success in the times ahead. 🙌 This seems fitting: \"Success is not final, failure is not fatal: It is the courage to continue that counts.\"—Winston Churchill. And to play us out for the weekend, a bit of Lionel 🎉🤪"
    },
    {
      "id": 19,
      "name": "Yasien Watkin",
      "date": "14/08/2023",
      "youtube": {
        "id": "9NdUJ4oNTIM",
        "title": "Bamboo Flute Music",
        "artist": "Music for Body and Spirit"
      },
      "quote": {
        "message": "The human brain cannot comprehend the Negative it is incapable, let me give you an example don't think of a pink elephant! I bet you thought of an elephant... Just like a skier who skies thinking don't hit the trees.. He inevitably hits the trees, thats the course he took his mind to. Where as the skier who looks for the path ends up sliding in out between the trees following an unclear path, but a path he has set his mind on. Just like the skier we all will come across obstacles we must not allow ourselves to focus on these obstacles! We shall set our minds on the end goal the path and that is what we will achieve"
      },
      "message": "😶‍🌫️ Good morning everyone, this is my input to our daily joy messages. The human brain cannot comprehend the Negative it is incapable, let me give you an example don't think of a pink elephant! I bet you thought of an elephant... Just like a skier who skies thinking don't hit the trees.. He inevitably hits the trees, thats the course he took his mind to. Where as the skier who looks for the path ends up sliding in out between the trees following an unclear path, but a path he has set his mind on. Just like the skier we all will come across obstacles we must not allow ourselves to focus on these obstacles! We shall set our minds on the end goal the path and that is what we will achieve ✨ Have a lovely day!"
    },
    {
      "id": 20,
      "name": "Mohsin",
      "date": "16/08/2023",
      "youtube": {
        "id": "hVkBlsgthLg",
        "title": "Superstar",
        "artist": "Lupe Fiasco"
      },
      "quote": {
        "message": "There is no better than adversity. Every defeat, every heartbreak, every loss, contains its own seed, its own lesson on how to improve your performance next time",
        "name": "Malcom X"
      },
      "message": "Thanks @Yasien Watkin for the nomination for the daily joy challenge. The motivational quote I wanted to share: “There is no better than adversity. Every defeat, every heartbreak, every loss, contains its own seed, its own lesson on how to improve your performance next time.” - Malcolm X. My song for the day is Superstar by Lupe Fiasco. Hope you enjoy it as much as I do! I nominate @David Ade for tomorrow. Hope everyone has a great productive day!"
    },
    {
      "id": 21,
      "name": "David Ade",
      "date": "17/08/2023",
      "youtube": {
        "id": "R4qud199tQk",
        "title": "Ku So La",
        "artist": "Oxlade"
      },
      "quote": {
        "message": "If you can't fly then run, if you can't run walk, if you can't walk crawl, but by all means keep moving.",
        "name": "Dr. Martin Luther King Jr"
      },
      "message": "Thanks @Mohsin for the the nomination, as we spend our last day in the office and move on to our next careers I felt this quote was fitting: “If you can't fly then run, if you can't run walk, if you can't walk crawl, but by all means keep moving.” -Dr. Martin Luther King Jr - I'll sign off with this song hope you enjoy -Oxlade - Ku So La. I nominate @Muhammad Mehmood for tomorrow! enjoy your day everyone"
    }
  ],
  "cohort": {
    "names": [
      "Alexander Wilson",
      "Alina Ermakova",
      "Ami Day",
      "Andrew Shakespeare",
      "Benedict Valuks",
      "Carolina",
      "David Ade",
      "Denise Chan",
      "Ellie Priestley",
      "Emily Cowan",
      "Fenella Powell",
      "Huda",
      "Jake Siney",
      "Kumani Kidd",
      "Lateef Oyelade",
      "Mohsin",
      "Mohsina Ahmed Chowdhury",
      "Muhammad Mehmood",
      "Rikie Patrick",
      "Roberto Quadraccia",
      "Sarah Ellis",
      "Senthooran",
      "Yasien Watkin",
      "Zubayda Hagi"
    ]
  }
}
