{
  "joys": [
    {
      "id": 0,
      "name": "Fenella Powell",
      "date": "11/07/2023",
      "youtube": {
        "id": "rmdiaQM43bk",
        "title": "Walking on Sunshine",
        "artist": "Katrina & The Waves"
      },
      "quote": {
        "message": "You are braver than you believe, stronger than you seem, and smarter than you think.",
        "name": "A.A. Milne"
      },
      "message": "Good Morning @channel\nI thought I would pop in and start the ✨ Daily Joy Challenge ✨\nEvery morning one member of the cohort posts some motivational / inspirational / words of their own or a quote, along with a song of their choice to bring some joy to the cohort for the day\nMy choice of song as a classic wake up song Walking on Sunshine\nMy go to quote is also this one\n“You are braver than you believe, stronger than you seem, and smarter than you think.” - A.A. Milne\nI tag @Benedict to bring in the joy tomorrow! Have a great day!"
    },
    {
      "id": 1,
      "name": "Benedict Valuks",
      "date": "12/07/2023",
      "youtube": {
        "id": "aQUIA8Hcv4a",
        "title": "Mr Blue Sky",
        "artist": "The Electric Light Orchestra"
      },
      "quote": {
        "message": "I have not failed. I've just found 10,000 ways that won't work.",
        "name": "Thomas A. Edison"
      },
      "message": "Good morning everyone!\nI'm feeling energised after my cycle ride in.\nIt is my turn this morning to bring the joy in the ✨ Daily Joy Challenge ✨\nFirstly, I'd like to thank everyone for their support so far. I am very excited about the journey ahead.My choice of song is Mr Blue Sky by The Electric Light Orchestra. It is one of my absolute favourite songs and is nothing but positive vibes.\nFor my quote, I have chosen one which I think is is quite applicable to coding:“I have not failed. I've just found 10,000 ways that won't work.”\n― Thomas A. EdisonI hope everyone has a great day!"
    },
    {
      "id": 2,
      "name": "Rikie Patrick",
      "date": "13/07/2023",
      "youtube": {
        "id": "phXRX1p8woY",
        "title": "We Are All We Need",
        "artist": "Above and Beyond"
      },
      "quote": {
        "message": "There is still a lot to learn and there is always great stuff out there. Even mistakes can be wonderful",
        "name": "Robin Williams"
      },
      "message": "Thanks @Benedict for the nomination in the ✨ Daily Joy Challenge ✨\nI would also like to echo Ben's words from yesterday. Don't ever be afraid to reach out for help and support if you need it. Looking forward to the next 4 months and beyond.\nMy choice of song comes from a trio I have seen many times. Their sets always fill the room with such happiness and euphoria! Zoë Johnston features with stunning vocals on a song by Above and Beyond called “We’re All We Need”.\nMy inspirational quote comes from an incredible actor; the late, great and talented Robin Williams who dedicated his life to putting smile on other peoples face.\n“There is still a lot to learn and there is always great stuff out there. Even mistakes can be wonderful”\n ― Robin Williams\n@Ellie Priestley 🫵 You're up next!\nHave an awesome day! 👋"
    },
    {
      "id": 3,
      "name": "Ellie Priestley",
      "date": "14/07/2023",
      "youtube": {
        "id": "Gs069dndIYk",
        "title": "September",
        "artist": "Earth, Wind & Fire"
      },
      "quote": {
        "message": "The rest is just as important as the work"
      },
      "message": "Thanks for the nomination @Rikie Patrick, and happy Friday everyone!\nSo crazy to think we're almost at the end of our first week! Hope everyone is feeling positive and ready for an amazing weekend! ☺️With that theme in mind, my quote for ✨Daily Joy Challenge✨ today is:\n\"The rest is just as important as the work\"\nI've had to remind myself of this constantly this week - it's so easy to get hooked on the challenges and before you know it hours have passed! Remember we're only a week into our four months, and that it's a marathon rather than a sprint. Let's make sure to all take some time this weekend to recharge and reset so we can all be energised for next week 🥳Following on from the Friday theme, my song of the day pick is \"September\" by Earth, Wind & Fire: an absolute classic Friday bop 🕺\nMy nomination for Monday is @Kumani! Have a restful weekend all and see you soon 💫"
    }
  ],
  "cohort": {
    "names": [
      "Alexander Wilson",
      "Alina Ermakova",
      "Ami Day",
      "Andrew Shakespeare",
      "Benedict Valuks",
      "Carolina",
      "David Ade",
      "Denise Chan",
      "Ellie Priestley",
      "Emily Cowan",
      "Eóin",
      "Fenella Powell",
      "Hafsah Saleh",
      "Huda",
      "Jake Siney",
      "John Forster",
      "Kumani Kidd",
      "Lateef Oyelade",
      "Léo Hetsch",
      "Mohsin",
      "Mohsina Ahmed Chowdhury",
      "Muhammad Mehmood",
      "Rikie Patrick",
      "Roberto Quadraccia",
      "Sarah Ellis",
      "Senthooran",
      "Yasien Watkin",
      "Zubayda Hagi"
    ]
  }
}


